from core.basic.skill import 技能
from core.basic.character import Character
from core.basic.skill import 主动技能, 被动技能


class 技能0(被动技能):
    名称 = '骑士信念'
    所在等级 = 15
    等级上限 = 20
    基础等级 = 10
    冷却关联技能 = ['所有']
    非冷却关联技能 = ['天马流星落', '暮光之灵黄昏独角兽', '生命之律·神木擎天']

    def CD缩减倍率(self, 武器类型):
        return 0.9

    def 物理攻击力倍率(self, 武器类型):
        if self.等级 == 0:
            return 1.0
        else:
            return round(1.10 + 0.02 * self.等级, 5)


class 技能1(主动技能):
    名称 = '强踢'
    所在等级 = 1
    等级上限 = 70
    等级精通 = 60
    学习间隔 = 2
    data0 = [(i*1.0) for i in [0, 762, 839, 916, 994, 1071, 1148, 1226, 1303, 1380, 1458, 1535, 1612, 1690, 1767, 1844, 1922, 1999, 2076, 2154, 2231, 2308, 2386, 2463, 2540, 2617, 2695, 2772, 2849, 2927, 3004, 3081, 3159, 3236,
                               3313, 3391, 3468, 3545, 3623, 3700, 3777, 3855, 3932, 4009, 4087, 4164, 4241, 4319, 4396, 4473, 4551, 4628, 4705, 4783, 4860, 4937, 5015, 5092, 5169, 5247, 5324, 5401, 5478, 5556, 5633, 5710, 5788, 5865, 5942, 6020, 6097]]
    # 基础 = 684.7
    # 成长 = 77.3
    CD = 5

    形态 = ["6C","5C","4C","3C"]

    def 形态变更(self, 形态, char):
        if 形态 == '' and len(self.形态) > 0:
            形态 = self.形态[0]
        if 形态 == "6C":
            pass
        if 形态 == "5C":
            pass
        if 形态 == "4C":
            pass
        if 形态 == "3C":
            pass

class 技能5(主动技能):
    名称 = '盾击'
    所在等级 = 5

    等级上限 = 70
    等级精通 = 60
    学习间隔 = 2

    data0 = [(i*1.0) for i in [0, 327, 360, 393, 426, 459, 492, 526, 559, 592, 625, 658, 692, 725, 758, 791, 824, 857, 891, 924, 957, 990, 1023, 1057, 1090, 1123, 1156, 1189, 1222, 1256, 1289, 1322, 1355, 1388, 1421, 1455,
                               1488, 1521, 1554, 1587, 1621, 1654, 1687, 1720, 1753, 1786, 1820, 1853, 1886, 1919, 1952, 1986, 2019, 2052, 2085, 2118, 2151, 2185, 2218, 2251, 2284, 2317, 2351, 2384, 2417, 2450, 2483, 2516, 2550, 2583, 2616]]
    CD = 3

class 技能6(主动技能):
    名称 = '致命突刺'
    所在等级 = 10
    等级上限 = 60
    基础等级 = 48
    # 基础 = 163.1
    # 成长 = 22.9
    data0 = [(i*1.0) for i in [0, 186, 210, 234, 256, 278, 303, 325, 348, 370, 394, 417, 438, 462, 485, 509, 530, 554, 576, 600, 622, 644, 668, 691, 714, 737, 759, 782, 804, 828, 851, 875, 897, 919, 943, 965, 988,
                               1011, 1034, 1057, 1079, 1103, 1127, 1149, 1171, 1193, 1217, 1241, 1262, 1285, 1309, 1466, 1491, 1516, 1544, 1568, 1594, 1619, 1644, 1671, 1696, 1722, 1747, 1772, 1799, 1825, 1850, 1876, 1901, 1928, 1952]]
    # 最大蓄气时物理攻击力：<data1>%
    # data1 = [0, 234, 264, 292, 320, 348, 378, 406, 434, 463, 492, 520, 548, 576, 606, 636, 662, 693, 721, 750, 776, 805, 835, 864, 892, 921, 949, 978, 1006, 1035, 1064, 1093, 1121, 1149, 1178, 1207, 1234, 1264, 1294, 1321, 1349, 1377, 1408, 1436, 1463, 1493, 1522, 1550, 1577, 1605, 1636, 1833, 1864, 1896, 1928, 1960, 1992, 2023, 2056, 2089, 2120, 2153, 2184, 2217, 2248, 2281, 2312, 2345, 2379, 2409, 2440]
    CD = 3

class classChange(Character):
    def __init__(self):
        self.实际名称 = 'elven_knight'
        self.名称 = '皓曦·精灵骑士'
        self.角色 = '守护者'

        self.职业 = '精灵骑士'

        self.武器选项 = ['太刀', '钝器', '巨剑', '短剑']
        self.输出类型选项 = ['物理百分比']
        self.防具精通属性 = ['力量']
        self.类型 = '物理百分比'
        self.武器类型 = "巨剑"
        self.防具类型 = '板甲'  # 布甲#板甲#重甲
        技能列表 = []
        技能序号 = {}
        i = 0
        while i >= 0:
            try:
                tem = eval('技能'+str(i)+'()')
                tem.基础等级计算()
                技能序号[tem.名称] = i
                技能列表.append(tem)
                i += 1
            except:
                i = -1
        self.技能栏 = 技能列表
        self.技能序号 = 技能序号
        self.buff = 2.03

        super().__init__()
